tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/wifi_manager/wpas/ieee802_11_defs.h
/*
 * IEEE 802.11 Frame type definitions
 * Copyright (c) 2002-2019, Jouni Malinen <j@w1.fi>
 * Copyright (c) 2007-2008 Intel Corporation
 *
 * This software may be distributed under the terms of the BSD license.
 * See README for more details.
 */

/*!
    \file    ieee802_11_defs.h
    \brief   ieee802.11 definitions

    \version 2023-07-20, V1.0.0, firmware for GD32VW55x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef _IEEE802_11_DEFS_H_
#define _IEEE802_11_DEFS_H_

#if defined(__CC_ARM)
#define STRUCT_PACKED           __attribute__ ((packed))
#elif defined(__ICCARM__)
#define STRUCT_PACKED           __attribute__((packed, aligned(1)))
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#define STRUCT_PACKED           __attribute__((packed, aligned(1)))
#elif defined ( __GNUC__ )
#define STRUCT_PACKED           __attribute__ ((packed))
#else
#define STRUCT_PACKED
#endif

/* IEEE 802.11 defines */
#ifndef WIFI_SSID_MAX_LEN
#define WIFI_SSID_MAX_LEN       32
#endif
#ifndef WIFI_ALEN
#define WIFI_ALEN               6
#endif

#define WLAN_FC_PVER            0x0003
#define WLAN_FC_TODS            0x0100
#define WLAN_FC_FROMDS          0x0200
#define WLAN_FC_MOREFRAG        0x0400
#define WLAN_FC_RETRY           0x0800
#define WLAN_FC_PWRMGT          0x1000
#define WLAN_FC_MOREDATA        0x2000
#define WLAN_FC_ISWEP           0x4000
#define WLAN_FC_HTC             0x8000

#define WLAN_FC_GET_TYPE(fc)    (((fc) & 0x000c) >> 2)
#define WLAN_FC_GET_STYPE(fc)   (((fc) & 0x00f0) >> 4)

#define WLAN_INVALID_MGMT_SEQ   0xFFFF

#define WLAN_GET_SEQ_FRAG(seq)  ((seq) & (BIT(3) | BIT(2) | BIT(1) | BIT(0)))
#define WLAN_GET_SEQ_SEQ(seq) \
    (((seq) & (~(BIT(3) | BIT(2) | BIT(1) | BIT(0)))) >> 4)

#define WLAN_FC_TYPE_MGMT       0
#define WLAN_FC_TYPE_CTRL       1
#define WLAN_FC_TYPE_DATA       2

/* management */
#define WLAN_FC_STYPE_ASSOC_REQ             0
#define WLAN_FC_STYPE_ASSOC_RESP            1
#define WLAN_FC_STYPE_REASSOC_REQ           2
#define WLAN_FC_STYPE_REASSOC_RESP          3
#define WLAN_FC_STYPE_PROBE_REQ             4
#define WLAN_FC_STYPE_PROBE_RESP            5
#define WLAN_FC_STYPE_BEACON                8
#define WLAN_FC_STYPE_ATIM                  9
#define WLAN_FC_STYPE_DISASSOC              10
#define WLAN_FC_STYPE_AUTH                  11
#define WLAN_FC_STYPE_DEAUTH                12
#define WLAN_FC_STYPE_ACTION                13
#define WLAN_FC_STYPE_ACTION_NO_ACK         14

/* control */
#define WLAN_FC_STYPE_PSPOLL                10
#define WLAN_FC_STYPE_RTS                   11
#define WLAN_FC_STYPE_CTS                   12
#define WLAN_FC_STYPE_ACK                   13
#define WLAN_FC_STYPE_CFEND                 14
#define WLAN_FC_STYPE_CFENDACK              15

/* data */
#define WLAN_FC_STYPE_DATA                  0
#define WLAN_FC_STYPE_DATA_CFACK            1
#define WLAN_FC_STYPE_DATA_CFPOLL           2
#define WLAN_FC_STYPE_DATA_CFACKPOLL        3
#define WLAN_FC_STYPE_NULLFUNC              4
#define WLAN_FC_STYPE_CFACK                 5
#define WLAN_FC_STYPE_CFPOLL                6
#define WLAN_FC_STYPE_CFACKPOLL             7
#define WLAN_FC_STYPE_QOS_DATA              8
#define WLAN_FC_STYPE_QOS_DATA_CFACK        9
#define WLAN_FC_STYPE_QOS_DATA_CFPOLL       10
#define WLAN_FC_STYPE_QOS_DATA_CFACKPOLL    11
#define WLAN_FC_STYPE_QOS_NULL              12
#define WLAN_FC_STYPE_QOS_CFPOLL            14
#define WLAN_FC_STYPE_QOS_CFACKPOLL         15

/* Authentication algorithms */
#define WLAN_AUTH_OPEN                      0
#define WLAN_AUTH_SHARED_KEY                1
#define WLAN_AUTH_FT                        2
#define WLAN_AUTH_SAE                       3
#define WLAN_AUTH_FILS_SK                   4
#define WLAN_AUTH_FILS_SK_PFS               5
#define WLAN_AUTH_FILS_PK                   6
#define WLAN_AUTH_PASN                      7
#define WLAN_AUTH_LEAP                      128

#define WLAN_AUTH_CHALLENGE_LEN             128

#define WLAN_CAPABILITY_ESS                 BIT(0)
#define WLAN_CAPABILITY_IBSS                BIT(1)
#define WLAN_CAPABILITY_CF_POLLABLE         BIT(2)
#define WLAN_CAPABILITY_CF_POLL_REQUEST     BIT(3)
#define WLAN_CAPABILITY_PRIVACY             BIT(4)
#define WLAN_CAPABILITY_SHORT_PREAMBLE      BIT(5)
#define WLAN_CAPABILITY_PBCC                BIT(6)
#define WLAN_CAPABILITY_CHANNEL_AGILITY     BIT(7)
#define WLAN_CAPABILITY_SPECTRUM_MGMT       BIT(8)
#define WLAN_CAPABILITY_QOS                 BIT(9)
#define WLAN_CAPABILITY_SHORT_SLOT_TIME     BIT(10)
#define WLAN_CAPABILITY_APSD                BIT(11)
#define WLAN_CAPABILITY_RADIO_MEASUREMENT   BIT(12)
#define WLAN_CAPABILITY_DSSS_OFDM           BIT(13)
#define WLAN_CAPABILITY_DELAYED_BLOCK_ACK   BIT(14)
#define WLAN_CAPABILITY_IMM_BLOCK_ACK       BIT(15)

/* Status codes (IEEE Std 802.11-2016, 9.4.1.9, Table 9-46) */
#define WLAN_STATUS_SUCCESS                                 0
#define WLAN_STATUS_UNSPECIFIED_FAILURE                     1
#define WLAN_STATUS_TDLS_WAKEUP_ALTERNATE                   2
#define WLAN_STATUS_TDLS_WAKEUP_REJECT                      3
#define WLAN_STATUS_SECURITY_DISABLED                       5
#define WLAN_STATUS_UNACCEPTABLE_LIFETIME                   6
#define WLAN_STATUS_NOT_IN_SAME_BSS                         7
#define WLAN_STATUS_CAPS_UNSUPPORTED                        10
#define WLAN_STATUS_REASSOC_NO_ASSOC                        11
#define WLAN_STATUS_ASSOC_DENIED_UNSPEC                     12
#define WLAN_STATUS_NOT_SUPPORTED_AUTH_ALG                  13
#define WLAN_STATUS_UNKNOWN_AUTH_TRANSACTION                14
#define WLAN_STATUS_CHALLENGE_FAIL                          15
#define WLAN_STATUS_AUTH_TIMEOUT                            16
#define WLAN_STATUS_AP_UNABLE_TO_HANDLE_NEW_STA             17
#define WLAN_STATUS_ASSOC_DENIED_RATES                      18
#define WLAN_STATUS_ASSOC_DENIED_NOSHORT                    19
#define WLAN_STATUS_SPEC_MGMT_REQUIRED                      22
#define WLAN_STATUS_PWR_CAPABILITY_NOT_VALID                23
#define WLAN_STATUS_SUPPORTED_CHANNEL_NOT_VALID             24
#define WLAN_STATUS_ASSOC_DENIED_NO_SHORT_SLOT_TIME         25
#define WLAN_STATUS_ASSOC_DENIED_NO_HT                      27
#define WLAN_STATUS_R0KH_UNREACHABLE                        28
#define WLAN_STATUS_ASSOC_DENIED_NO_PCO                     29
#define WLAN_STATUS_ASSOC_REJECTED_TEMPORARILY              30
#define WLAN_STATUS_ROBUST_MGMT_FRAME_POLICY_VIOLATION      31
#define WLAN_STATUS_UNSPECIFIED_QOS_FAILURE                 32
#define WLAN_STATUS_DENIED_INSUFFICIENT_BANDWIDTH           33
#define WLAN_STATUS_DENIED_POOR_CHANNEL_CONDITIONS          34
#define WLAN_STATUS_DENIED_QOS_NOT_SUPPORTED                35
#define WLAN_STATUS_REQUEST_DECLINED                        37
#define WLAN_STATUS_INVALID_PARAMETERS                      38
#define WLAN_STATUS_REJECTED_WITH_SUGGESTED_CHANGES         39
#define WLAN_STATUS_INVALID_IE                              40
#define WLAN_STATUS_GROUP_CIPHER_NOT_VALID                  41
#define WLAN_STATUS_PAIRWISE_CIPHER_NOT_VALID               42
#define WLAN_STATUS_AKMP_NOT_VALID                          43
#define WLAN_STATUS_UNSUPPORTED_RSN_IE_VERSION              44
#define WLAN_STATUS_INVALID_RSN_IE_CAPAB                    45
#define WLAN_STATUS_CIPHER_REJECTED_PER_POLICY              46
#define WLAN_STATUS_TS_NOT_CREATED                          47
#define WLAN_STATUS_DIRECT_LINK_NOT_ALLOWED                 48
#define WLAN_STATUS_DEST_STA_NOT_PRESENT                    49
#define WLAN_STATUS_DEST_STA_NOT_QOS_STA                    50
#define WLAN_STATUS_ASSOC_DENIED_LISTEN_INT_TOO_LARGE       51
#define WLAN_STATUS_INVALID_FT_ACTION_FRAME_COUNT           52
#define WLAN_STATUS_INVALID_PMKID                           53
#define WLAN_STATUS_INVALID_MDIE                            54
#define WLAN_STATUS_INVALID_FTIE                            55
#define WLAN_STATUS_REQUESTED_TCLAS_NOT_SUPPORTED           56
#define WLAN_STATUS_INSUFFICIENT_TCLAS_PROCESSING_RESOURCES 57
#define WLAN_STATUS_TRY_ANOTHER_BSS                         58
#define WLAN_STATUS_GAS_ADV_PROTO_NOT_SUPPORTED             59
#define WLAN_STATUS_NO_OUTSTANDING_GAS_REQ                  60
#define WLAN_STATUS_GAS_RESP_NOT_RECEIVED                   61
#define WLAN_STATUS_STA_TIMED_OUT_WAITING_FOR_GAS_RESP      62
#define WLAN_STATUS_GAS_RESP_LARGER_THAN_LIMIT              63
#define WLAN_STATUS_REQ_REFUSED_HOME                        64
#define WLAN_STATUS_ADV_SRV_UNREACHABLE                     65
#define WLAN_STATUS_REQ_REFUSED_SSPN                        67
#define WLAN_STATUS_REQ_REFUSED_UNAUTH_ACCESS               68
#define WLAN_STATUS_INVALID_RSNIE                           72
#define WLAN_STATUS_U_APSD_COEX_NOT_SUPPORTED               73
#define WLAN_STATUS_U_APSD_COEX_MODE_NOT_SUPPORTED          74
#define WLAN_STATUS_BAD_INTERVAL_WITH_U_APSD_COEX           75
#define WLAN_STATUS_ANTI_CLOGGING_TOKEN_REQ                 76
#define WLAN_STATUS_FINITE_CYCLIC_GROUP_NOT_SUPPORTED       77
#define WLAN_STATUS_CANNOT_FIND_ALT_TBTT                    78
#define WLAN_STATUS_TRANSMISSION_FAILURE                    79
#define WLAN_STATUS_REQ_TCLAS_NOT_SUPPORTED                 80
#define WLAN_STATUS_TCLAS_RESOURCES_EXCHAUSTED              81
#define WLAN_STATUS_REJECTED_WITH_SUGGESTED_BSS_TRANSITION  82
#define WLAN_STATUS_REJECT_WITH_SCHEDULE                    83
#define WLAN_STATUS_REJECT_NO_WAKEUP_SPECIFIED              84
#define WLAN_STATUS_SUCCESS_POWER_SAVE_MODE                 85
#define WLAN_STATUS_PENDING_ADMITTING_FST_SESSION           86
#define WLAN_STATUS_PERFORMING_FST_NOW                      87
#define WLAN_STATUS_PENDING_GAP_IN_BA_WINDOW                88
#define WLAN_STATUS_REJECT_U_PID_SETTING                    89
#define WLAN_STATUS_REFUSED_EXTERNAL_REASON                 92
#define WLAN_STATUS_REFUSED_AP_OUT_OF_MEMORY                93
#define WLAN_STATUS_REJECTED_EMERGENCY_SERVICE_NOT_SUPPORTED 94
#define WLAN_STATUS_QUERY_RESP_OUTSTANDING                  95
#define WLAN_STATUS_REJECT_DSE_BAND                         96
#define WLAN_STATUS_TCLAS_PROCESSING_TERMINATED             97
#define WLAN_STATUS_TS_SCHEDULE_CONFLICT                    98
#define WLAN_STATUS_DENIED_WITH_SUGGESTED_BAND_AND_CHANNEL  99
#define WLAN_STATUS_MCCAOP_RESERVATION_CONFLICT             100
#define WLAN_STATUS_MAF_LIMIT_EXCEEDED                      101
#define WLAN_STATUS_MCCA_TRACK_LIMIT_EXCEEDED               102
#define WLAN_STATUS_DENIED_DUE_TO_SPECTRUM_MANAGEMENT       103
#define WLAN_STATUS_ASSOC_DENIED_NO_VHT                     104
#define WLAN_STATUS_ENABLEMENT_DENIED                       105
#define WLAN_STATUS_RESTRICTION_FROM_AUTHORIZED_GDB         106
#define WLAN_STATUS_AUTHORIZATION_DEENABLED                 107
#define WLAN_STATUS_FILS_AUTHENTICATION_FAILURE             112
#define WLAN_STATUS_UNKNOWN_AUTHENTICATION_SERVER           113
#define WLAN_STATUS_UNKNOWN_PASSWORD_IDENTIFIER             123
#define WLAN_STATUS_DENIED_HE_NOT_SUPPORTED                 124
#define WLAN_STATUS_SAE_HASH_TO_ELEMENT                     126
#define WLAN_STATUS_SAE_PK                                  127

/* Reason codes (IEEE Std 802.11-2016, 9.4.1.7, Table 9-45) */
#define WLAN_REASON_UNSPECIFIED                         1
#define WLAN_REASON_PREV_AUTH_NOT_VALID                 2
#define WLAN_REASON_DEAUTH_LEAVING                      3
#define WLAN_REASON_DISASSOC_DUE_TO_INACTIVITY          4
#define WLAN_REASON_DISASSOC_AP_BUSY                    5
#define WLAN_REASON_CLASS2_FRAME_FROM_NONAUTH_STA       6
#define WLAN_REASON_CLASS3_FRAME_FROM_NONASSOC_STA      7
#define WLAN_REASON_DISASSOC_STA_HAS_LEFT               8
#define WLAN_REASON_STA_REQ_ASSOC_WITHOUT_AUTH          9
#define WLAN_REASON_PWR_CAPABILITY_NOT_VALID            10
#define WLAN_REASON_SUPPORTED_CHANNEL_NOT_VALID         11
#define WLAN_REASON_BSS_TRANSITION_DISASSOC             12
#define WLAN_REASON_INVALID_IE                          13
#define WLAN_REASON_MICHAEL_MIC_FAILURE                 14
#define WLAN_REASON_4WAY_HANDSHAKE_TIMEOUT              15
#define WLAN_REASON_GROUP_KEY_UPDATE_TIMEOUT            16
#define WLAN_REASON_IE_IN_4WAY_DIFFERS                  17
#define WLAN_REASON_GROUP_CIPHER_NOT_VALID              18
#define WLAN_REASON_PAIRWISE_CIPHER_NOT_VALID           19
#define WLAN_REASON_AKMP_NOT_VALID                      20
#define WLAN_REASON_UNSUPPORTED_RSN_IE_VERSION          21
#define WLAN_REASON_INVALID_RSN_IE_CAPAB                22
#define WLAN_REASON_IEEE_802_1X_AUTH_FAILED             23
#define WLAN_REASON_CIPHER_SUITE_REJECTED               24
#define WLAN_REASON_TDLS_TEARDOWN_UNREACHABLE           25
#define WLAN_REASON_TDLS_TEARDOWN_UNSPECIFIED           26
#define WLAN_REASON_SSP_REQUESTED_DISASSOC              27
#define WLAN_REASON_NO_SSP_ROAMING_AGREEMENT            28
#define WLAN_REASON_BAD_CIPHER_OR_AKM                   29
#define WLAN_REASON_NOT_AUTHORIZED_THIS_LOCATION        30
#define WLAN_REASON_SERVICE_CHANGE_PRECLUDES_TS         31
#define WLAN_REASON_UNSPECIFIED_QOS_REASON              32
#define WLAN_REASON_NOT_ENOUGH_BANDWIDTH                33
#define WLAN_REASON_DISASSOC_LOW_ACK                    34
#define WLAN_REASON_EXCEEDED_TXOP                       35
#define WLAN_REASON_STA_LEAVING                         36
#define WLAN_REASON_END_TS_BA_DLS                       37
#define WLAN_REASON_UNKNOWN_TS_BA                       38
#define WLAN_REASON_TIMEOUT                             39
// reason 40-44 is reserved
#define WLAN_REASON_GD_MESH_SMART_AP_RESET              40 // GD modified
#define WLAN_REASON_PEERKEY_MISMATCH                    45
#define WLAN_REASON_AUTHORIZED_ACCESS_LIMIT_REACHED     46
#define WLAN_REASON_EXTERNAL_SERVICE_REQUIREMENTS       47
#define WLAN_REASON_INVALID_FT_ACTION_FRAME_COUNT       48
#define WLAN_REASON_INVALID_PMKID                       49
#define WLAN_REASON_INVALID_MDE                         50
#define WLAN_REASON_INVALID_FTE                         51
#define WLAN_REASON_MESH_PEERING_CANCELLED              52
#define WLAN_REASON_MESH_MAX_PEERS                      53
#define WLAN_REASON_MESH_CONFIG_POLICY_VIOLATION        54
#define WLAN_REASON_MESH_CLOSE_RCVD                     55
#define WLAN_REASON_MESH_MAX_RETRIES                    56
#define WLAN_REASON_MESH_CONFIRM_TIMEOUT                57
#define WLAN_REASON_MESH_INVALID_GTK                    58
#define WLAN_REASON_MESH_INCONSISTENT_PARAMS            59
#define WLAN_REASON_MESH_INVALID_SECURITY_CAP           60
#define WLAN_REASON_MESH_PATH_ERROR_NO_PROXY_INFO       61
#define WLAN_REASON_MESH_PATH_ERROR_NO_FORWARDING_INFO  62
#define WLAN_REASON_MESH_PATH_ERROR_DEST_UNREACHABLE    63
#define WLAN_REASON_MAC_ADDRESS_ALREADY_EXISTS_IN_MBSS  64
#define WLAN_REASON_MESH_CHANNEL_SWITCH_REGULATORY_REQ  65
#define WLAN_REASON_MESH_CHANNEL_SWITCH_UNSPECIFIED     66

