tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/wifi_manager/wpas/ieee802_11_defs.h
/* Information Element IDs (IEEE Std 802.11-2016, 9.4.2.1, Table 9-77) */
#define WLAN_EID_SSID                                   0
#define WLAN_EID_SUPP_RATES                             1
#define WLAN_EID_DS_PARAMS                              3
#define WLAN_EID_CF_PARAMS                              4
#define WLAN_EID_TIM                                    5
#define WLAN_EID_IBSS_PARAMS                            6
#define WLAN_EID_COUNTRY                                7
#define WLAN_EID_REQUEST                                10
#define WLAN_EID_BSS_LOAD                               11
#define WLAN_EID_EDCA_PARAM_SET                         12
#define WLAN_EID_TSPEC                                  13
#define WLAN_EID_TCLAS                                  14
#define WLAN_EID_SCHEDULE                               15
#define WLAN_EID_CHALLENGE                              16
#define WLAN_EID_PWR_CONSTRAINT                         32
#define WLAN_EID_PWR_CAPABILITY                         33
#define WLAN_EID_TPC_REQUEST                            34
#define WLAN_EID_TPC_REPORT                             35
#define WLAN_EID_SUPPORTED_CHANNELS                     36
#define WLAN_EID_CHANNEL_SWITCH                         37
#define WLAN_EID_MEASURE_REQUEST                        38
#define WLAN_EID_MEASURE_REPORT                         39
#define WLAN_EID_QUIET                                  40
#define WLAN_EID_IBSS_DFS                               41
#define WLAN_EID_ERP_INFO                               42
#define WLAN_EID_TS_DELAY                               43
#define WLAN_EID_TCLAS_PROCESSING                       44
#define WLAN_EID_HT_CAP                                 45
#define WLAN_EID_QOS                                    46
#define WLAN_EID_RSN                                    48
#define WLAN_EID_EXT_SUPP_RATES                         50
#define WLAN_EID_AP_CHANNEL_REPORT                      51
#define WLAN_EID_NEIGHBOR_REPORT                        52
#define WLAN_EID_RCPI                                   53
#define WLAN_EID_MOBILITY_DOMAIN                        54
#define WLAN_EID_FAST_BSS_TRANSITION                    55
#define WLAN_EID_TIMEOUT_INTERVAL                       56
#define WLAN_EID_RIC_DATA                               57
#define WLAN_EID_DSE_REGISTERED_LOCATION                58
#define WLAN_EID_SUPPORTED_OPERATING_CLASSES            59
#define WLAN_EID_EXT_CHANSWITCH_ANN                     60
#define WLAN_EID_HT_OPERATION                           61
#define WLAN_EID_SECONDARY_CHANNEL_OFFSET               62
#define WLAN_EID_BSS_AVERAGE_ACCESS_DELAY               63
#define WLAN_EID_ANTENNA                                64
#define WLAN_EID_RSNI                                   65
#define WLAN_EID_MEASUREMENT_PILOT_TRANSMISSION         66
#define WLAN_EID_BSS_AVAILABLE_ADM_CAPA                 67
#define WLAN_EID_BSS_AC_ACCESS_DELAY                    68 /* note: also used by WAPI */
#define WLAN_EID_TIME_ADVERTISEMENT                     69
#define WLAN_EID_RRM_ENABLED_CAPABILITIES               70
#define WLAN_EID_MULTIPLE_BSSID                         71
#define WLAN_EID_20_40_BSS_COEXISTENCE                  72
#define WLAN_EID_20_40_BSS_INTOLERANT                   73
#define WLAN_EID_OVERLAPPING_BSS_SCAN_PARAMS            74
#define WLAN_EID_RIC_DESCRIPTOR                         75
#define WLAN_EID_MMIE                                   76
#define WLAN_EID_EVENT_REQUEST                          78
#define WLAN_EID_EVENT_REPORT                           79
#define WLAN_EID_DIAGNOSTIC_REQUEST                     80
#define WLAN_EID_DIAGNOSTIC_REPORT                      81
#define WLAN_EID_LOCATION_PARAMETERS                    82
#define WLAN_EID_NONTRANSMITTED_BSSID_CAPA              83
#define WLAN_EID_SSID_LIST                              84
#define WLAN_EID_MULTIPLE_BSSID_INDEX                   85
#define WLAN_EID_FMS_DESCRIPTOR                         86
#define WLAN_EID_FMS_REQUEST                            87
#define WLAN_EID_FMS_RESPONSE                           88
#define WLAN_EID_QOS_TRAFFIC_CAPABILITY                 89
#define WLAN_EID_BSS_MAX_IDLE_PERIOD                    90
#define WLAN_EID_TFS_REQ                                91
#define WLAN_EID_TFS_RESP                               92
#define WLAN_EID_WNMSLEEP                               93
#define WLAN_EID_TIM_BROADCAST_REQUEST                  94
#define WLAN_EID_TIM_BROADCAST_RESPONSE                 95
#define WLAN_EID_COLLOCATED_INTERFERENCE_REPORT         96
#define WLAN_EID_CHANNEL_USAGE                          97
#define WLAN_EID_TIME_ZONE                              98
#define WLAN_EID_DMS_REQUEST                            99
#define WLAN_EID_DMS_RESPONSE                           100
#define WLAN_EID_LINK_ID                                101
#define WLAN_EID_WAKEUP_SCHEDULE                        102
#define WLAN_EID_CHANNEL_SWITCH_TIMING                  104
#define WLAN_EID_PTI_CONTROL                            105
#define WLAN_EID_TPU_BUFFER_STATUS                      106
#define WLAN_EID_INTERWORKING                           107
#define WLAN_EID_ADV_PROTO                              108
#define WLAN_EID_EXPEDITED_BANDWIDTH_REQ                109
#define WLAN_EID_QOS_MAP_SET                            110
#define WLAN_EID_ROAMING_CONSORTIUM                     111
#define WLAN_EID_EMERGENCY_ALERT_ID                     112
#define WLAN_EID_MESH_CONFIG                            113
#define WLAN_EID_MESH_ID                                114
#define WLAN_EID_MESH_LINK_METRIC_REPORT                115
#define WLAN_EID_CONGESTION_NOTIFICATION                116
#define WLAN_EID_PEER_MGMT                              117
#define WLAN_EID_MESH_CHANNEL_SWITCH_PARAMETERS         118
#define WLAN_EID_MESH_AWAKE_WINDOW                      119
#define WLAN_EID_BEACON_TIMING                          120
#define WLAN_EID_MCCAOP_SETUP_REQUEST                   121
#define WLAN_EID_MCCAOP_SETUP_REPLY                     122
#define WLAN_EID_MCCAOP_ADVERTISEMENT                   123
#define WLAN_EID_MCCAOP_TEARDOWN                        124
#define WLAN_EID_GANN                                   125
#define WLAN_EID_RANN                                   126
#define WLAN_EID_EXT_CAPAB                              127
#define WLAN_EID_PREQ                                   130
#define WLAN_EID_PREP                                   131
#define WLAN_EID_PERR                                   132
#define WLAN_EID_PXU                                    137
#define WLAN_EID_PXUC                                   138
#define WLAN_EID_AMPE                                   139
#define WLAN_EID_MIC                                    140
#define WLAN_EID_DESTINATION_URI                        141
#define WLAN_EID_U_APSD_COEX                            142
#define WLAN_EID_DMG_WAKEUP_SCHEDULE                    143
#define WLAN_EID_EXTENDED_SCHEDULE                      144
#define WLAN_EID_STA_AVAILABILITY                       145
#define WLAN_EID_DMG_TSPEC                              146
#define WLAN_EID_NEXT_DMG_ATI                           147
#define WLAN_EID_DMG_CAPABILITIES                       148
#define WLAN_EID_DMG_OPERATION                          151
#define WLAN_EID_DMG_BSS_PARAMETER_CHANGE               152
#define WLAN_EID_DMG_BEAM_REFINEMENT                    153
#define WLAN_EID_CHANNEL_MEASUREMENT_FEEDBACK           154
#define WLAN_EID_CCKM                                   156
#define WLAN_EID_AWAKE_WINDOW                           157
#define WLAN_EID_MULTI_BAND                             158
#define WLAN_EID_ADDBA_EXTENSION                        159
#define WLAN_EID_NEXTPCP_LIST                           160
#define WLAN_EID_PCP_HANDOVER                           161
#define WLAN_EID_DMG_LINK_MARGIN                        162
#define WLAN_EID_SWITCHING_STREAM                       163
#define WLAN_EID_SESSION_TRANSITION                     164
#define WLAN_EID_DYNAMIC_TONE_PAIRING_REPORT            165
#define WLAN_EID_CLUSTER_REPORT                         166
#define WLAN_EID_REPLAY_CAPABILITIES                    167
#define WLAN_EID_RELAY_TRANSFER_PARAM_SET               168
#define WLAN_EID_BEAMLINK_MAINTENANCE                   169
#define WLAN_EID_MULTIPLE_MAC_SUBLAYERS                 170
#define WLAN_EID_U_PID                                  171
#define WLAN_EID_DMG_LINK_ADAPTATION_ACK                172
#define WLAN_EID_MCCAOP_ADVERTISEMENT_OVERVIEW          174
#define WLAN_EID_QUIET_PERIOD_REQUEST                   175
#define WLAN_EID_QUIET_PERIOD_RESPONSE                  177
#define WLAN_EID_QMF_POLICY                             181
#define WLAN_EID_ECAPC_POLICY                           182
#define WLAN_EID_CLUSTER_TIME_OFFSET                    183
#define WLAN_EID_INTRA_ACCESS_CATEGORY_PRIORITY         184
#define WLAN_EID_SCS_DESCRIPTOR                         185
#define WLAN_EID_QLOAD_REPORT                           186
#define WLAN_EID_HCCA_TXOP_UPDATE_COUNT                 187
#define WLAN_EID_HIGHER_LAYER_STREAM_ID                 188
#define WLAN_EID_GCR_GROUP_ADDRESS                      189
#define WLAN_EID_ANTENNA_SECTOR_ID_PATTERN              190
#define WLAN_EID_VHT_CAP                                191
#define WLAN_EID_VHT_OPERATION                          192
#define WLAN_EID_VHT_EXTENDED_BSS_LOAD                  193
#define WLAN_EID_VHT_WIDE_BW_CHSWITCH                   194
#define WLAN_EID_TRANSMIT_POWER_ENVELOPE                195
#define WLAN_EID_VHT_CHANNEL_SWITCH_WRAPPER             196
#define WLAN_EID_VHT_AID                                197
#define WLAN_EID_VHT_QUIET_CHANNEL                      198
#define WLAN_EID_VHT_OPERATING_MODE_NOTIFICATION        199
#define WLAN_EID_UPSIM                                  200
#define WLAN_EID_REDUCED_NEIGHBOR_REPORT                201
#define WLAN_EID_TVHT_OPERATION                         202
#define WLAN_EID_DEVICE_LOCATION                        204
#define WLAN_EID_WHITE_SPACE_MAP                        205
#define WLAN_EID_FTM_PARAMETERS                         206
#define WLAN_EID_S1G_BCN_COMPAT                         213
#define WLAN_EID_TWT                                    216
#define WLAN_EID_S1G_CAPABILITIES                       217
#define WLAN_EID_VENDOR_SPECIFIC                        221
#define WLAN_EID_S1G_OPERATION                          232
#define WLAN_EID_CAG_NUMBER                             237
#define WLAN_EID_AP_CSN                                 239
#define WLAN_EID_FILS_INDICATION                        240
#define WLAN_EID_DILS                                   241
#define WLAN_EID_FRAGMENT                               242
#define WLAN_EID_RSNX                                   244
#define WLAN_EID_EXTENSION                              255

/* Element ID Extension (EID 255) values */
#define WLAN_EID_EXT_ASSOC_DELAY_INFO                   1
#define WLAN_EID_EXT_FILS_REQ_PARAMS                    2
#define WLAN_EID_EXT_FILS_KEY_CONFIRM                   3
#define WLAN_EID_EXT_FILS_SESSION                       4
#define WLAN_EID_EXT_FILS_HLP_CONTAINER                 5
#define WLAN_EID_EXT_FILS_IP_ADDR_ASSIGN                6
#define WLAN_EID_EXT_KEY_DELIVERY                       7
#define WLAN_EID_EXT_WRAPPED_DATA                       8
#define WLAN_EID_EXT_FTM_SYNC_INFO                      9
#define WLAN_EID_EXT_EXTENDED_REQUEST                   10
#define WLAN_EID_EXT_ESTIMATED_SERVICE_PARAMS           11
#define WLAN_EID_EXT_FILS_PUBLIC_KEY                    12
#define WLAN_EID_EXT_FILS_NONCE                         13
#define WLAN_EID_EXT_FUTURE_CHANNEL_GUIDANCE            14
#define WLAN_EID_EXT_OWE_DH_PARAM                       32
#define WLAN_EID_EXT_PASSWORD_IDENTIFIER                33
#define WLAN_EID_EXT_HE_CAPABILITIES                    35
#define WLAN_EID_EXT_HE_OPERATION                       36
#define WLAN_EID_EXT_HE_MU_EDCA_PARAMS                  38
#define WLAN_EID_EXT_SPATIAL_REUSE                      39
#define WLAN_EID_EXT_OCV_OCI                            54
#define WLAN_EID_EXT_SHORT_SSID_LIST                    58
#define WLAN_EID_EXT_HE_6GHZ_BAND_CAP                   59
#define WLAN_EID_EXT_EDMG_CAPABILITIES                  61
#define WLAN_EID_EXT_EDMG_OPERATION                     62
#define WLAN_EID_EXT_MSCS_DESCRIPTOR                    88
#define WLAN_EID_EXT_TCLAS_MASK                         89
#define WLAN_EID_EXT_REJECTED_GROUPS                    92
#define WLAN_EID_EXT_ANTI_CLOGGING_TOKEN                93
#define WLAN_EID_EXT_PASN_PARAMS                        100

/* Extended Capabilities field */
#define WLAN_EXT_CAPAB_20_40_COEX                       0
#define WLAN_EXT_CAPAB_GLK                              1
#define WLAN_EXT_CAPAB_EXT_CHAN_SWITCH                  2
#define WLAN_EXT_CAPAB_GLK_GCR                          3
#define WLAN_EXT_CAPAB_PSMP                             4
/* 5 - Reserved */
#define WLAN_EXT_CAPAB_S_PSMP                           6
#define WLAN_EXT_CAPAB_EVENT                            7
#define WLAN_EXT_CAPAB_DIAGNOSTICS                      8
#define WLAN_EXT_CAPAB_MULTICAST_DIAGNOSTICS            9
#define WLAN_EXT_CAPAB_LOCATION_TRACKING                10
#define WLAN_EXT_CAPAB_FMS                              11
#define WLAN_EXT_CAPAB_PROXY_ARP                        12
#define WLAN_EXT_CAPAB_COLL_INTERF_REP                  13
#define WLAN_EXT_CAPAB_CIVIC_LOCATION                   14
#define WLAN_EXT_CAPAB_GEOSPATIAL_LOCATION              15
#define WLAN_EXT_CAPAB_TFS                              16
#define WLAN_EXT_CAPAB_WNM_SLEEP_MODE                   17
#define WLAN_EXT_CAPAB_TIM_BROADCAST                    18
#define WLAN_EXT_CAPAB_BSS_TRANSITION                   19
#define WLAN_EXT_CAPAB_QOS_TRAFFIC                      20
#define WLAN_EXT_CAPAB_AC_STA_COUNT                     21
#define WLAN_EXT_CAPAB_MULTIPLE_BSSID                   22
#define WLAN_EXT_CAPAB_TIMING_MEASUREMENT               23
#define WLAN_EXT_CAPAB_CHANNEL_USAGE                    24
#define WLAN_EXT_CAPAB_SSID_LIST                        25
#define WLAN_EXT_CAPAB_DMS                              26
#define WLAN_EXT_CAPAB_UTF_TSF_OFFSET                   27
#define WLAN_EXT_CAPAB_TPU_BUFFER_STA                   28
#define WLAN_EXT_CAPAB_TDLS_PEER_PSM                    29
#define WLAN_EXT_CAPAB_TDLS_CHANNEL_SWITCH              30
#define WLAN_EXT_CAPAB_INTERWORKING                     31
#define WLAN_EXT_CAPAB_QOS_MAP                          32
#define WLAN_EXT_CAPAB_EBR                              33
#define WLAN_EXT_CAPAB_SSPN_INTERFACE                   34
/* 35 - Reserved */
#define WLAN_EXT_CAPAB_MSGCF                            36
#define WLAN_EXT_CAPAB_TDLS                             37
#define WLAN_EXT_CAPAB_TDLS_PROHIBITED                  38
#define WLAN_EXT_CAPAB_TDLS_CHANNEL_SWITCH_PROHIBITED   39
#define WLAN_EXT_CAPAB_REJECT_UNADMITTED_FRAME          40
/* 41-43 - Service Interval Granularity */
#define WLAN_EXT_CAPAB_IDENTIFIER_LOCATION              44
#define WLAN_EXT_CAPAB_U_APSD_COEX                      45
#define WLAN_EXT_CAPAB_WNM_NOTIFCATION                  46
#define WLAN_EXT_CAPAB_QAB                              47
#define WLAN_EXT_CAPAB_UTF_8_SSID                       48
#define WLAN_EXT_CAPAB_QMF                              49
#define WLAN_EXT_CAPAB_QMF_RECONFIG                     50
#define WLAN_EXT_CAPAB_ROBUST_AV_STREAMING              51
#define WLAN_EXT_CAPAB_ADVANCED_GCR                     52
#define WLAN_EXT_CAPAB_MESH_GCR                         53
#define WLAN_EXT_CAPAB_SCS                              54
#define WLAN_EXT_CAPAB_QLOAD_REPORT                     55
#define WLAN_EXT_CAPAB_ALT_EDCA                         56
#define WLAN_EXT_CAPAB_UNPROT_TXOP_NEG                  57
#define WLAN_EXT_CAPAB_PROT_TXOP_NEG                    58
/* 59 - Reserved */
#define WLAN_EXT_CAPAB_PROT_QLOAD_REPORT                60
#define WLAN_EXT_CAPAB_TDLS_WIDER_BW                    61
#define WLAN_EXT_CAPAB_OPMODE_NOTIF                     62
/* 63-64 - Max Number of MSDUs In A-MSDU */
#define WLAN_EXT_CAPAB_CHANNEL_SCHEDULE_MGMT            65
#define WLAN_EXT_CAPAB_GEODB_INBAND_ENABLING_SIGNAL     66
#define WLAN_EXT_CAPAB_NETWORK_CHANNEL_CTRL             67
#define WLAN_EXT_CAPAB_WHITE_SPACE_MAP                  68
#define WLAN_EXT_CAPAB_CHANNEL_AVAIL_QUERY              69
#define WLAN_EXT_CAPAB_FTM_RESPONDER                    70
#define WLAN_EXT_CAPAB_FTM_INITIATOR                    71
#define WLAN_EXT_CAPAB_FILS                             72
#define WLAN_EXT_CAPAB_EXT_SPECTRUM_MGMT                73
#define WLAN_EXT_CAPAB_FUTURE_CHANNEL_GUIDANCE          74
#define WLAN_EXT_CAPAB_PAD                              75
/* 76-79 - Reserved */
#define WLAN_EXT_CAPAB_COMPLETE_NON_TX_BSSID_PROFILE    80
#define WLAN_EXT_CAPAB_SAE_PW_ID                        81
#define WLAN_EXT_CAPAB_SAE_PW_ID_EXCLUSIVELY            82
#define WLAN_EXT_CAPAB_BEACON_PROTECTION                84
#define WLAN_EXT_CAPAB_MSCS                             85
#define WLAN_EXT_CAPAB_SAE_PK_EXCLUSIVELY               88

/* Extended RSN Capabilities */
/* bits 0-3: Field length (n-1) */
#define WLAN_RSNX_CAPAB_PROTECTED_TWT           4
#define WLAN_RSNX_CAPAB_SAE_H2E                 5
#define WLAN_RSNX_CAPAB_SAE_PK                  6
#define WLAN_RSNX_CAPAB_SECURE_LTF              8
#define WLAN_RSNX_CAPAB_SECURE_RTT              9
#define WLAN_RSNX_CAPAB_PROT_RANGE_NEG          10

/* Action frame categories (IEEE Std 802.11-2016, 9.4.1.11, Table 9-76) */
#define WLAN_ACTION_SPECTRUM_MGMT               0
#define WLAN_ACTION_QOS                         1
#define WLAN_ACTION_DLS                         2
#define WLAN_ACTION_BLOCK_ACK                   3
#define WLAN_ACTION_PUBLIC                      4
#define WLAN_ACTION_RADIO_MEASUREMENT           5
#define WLAN_ACTION_FT                          6
#define WLAN_ACTION_HT                          7
#define WLAN_ACTION_SA_QUERY                    8
#define WLAN_ACTION_PROTECTED_DUAL              9
#define WLAN_ACTION_WNM                         10
#define WLAN_ACTION_UNPROTECTED_WNM             11
#define WLAN_ACTION_TDLS                        12
#define WLAN_ACTION_MESH                        13
#define WLAN_ACTION_MULTIHOP                    14
#define WLAN_ACTION_SELF_PROTECTED              15
#define WLAN_ACTION_DMG                         16
#define WLAN_ACTION_WMM                         17 /* WMM Specification 1.1 */
#define WLAN_ACTION_FST                         18
#define WLAN_ACTION_ROBUST_AV_STREAMING         19
#define WLAN_ACTION_UNPROTECTED_DMG             20
#define WLAN_ACTION_VHT                         21
#define WLAN_ACTION_S1G                         22
#define WLAN_ACTION_S1G_RELAY                   23
#define WLAN_ACTION_FLOW_CONTROL                24
#define WLAN_ACTION_CTRL_RESP_MCS_NEG           25
#define WLAN_ACTION_FILS                        26
#define WLAN_ACTION_PROTECTED_FTM               34
#define WLAN_ACTION_VENDOR_SPECIFIC_PROTECTED   126
#define WLAN_ACTION_VENDOR_SPECIFIC             127
/* Note: 128-255 used to report errors by setting category | 0x80 */

/* Public action codes (IEEE Std 802.11-2016, 9.6.8.1, Table 9-307) */
#define WLAN_PA_20_40_BSS_COEX                  0
#define WLAN_PA_DSE_ENABLEMENT                  1
#define WLAN_PA_DSE_DEENABLEMENT                2
#define WLAN_PA_DSE_REG_LOCATION_ANNOUNCE       3
#define WLAN_PA_EXT_CHANNEL_SWITCH_ANNOUNCE     4
#define WLAN_PA_DSE_MEASUREMENT_REQ             5
#define WLAN_PA_DSE_MEASUREMENT_RESP            6
#define WLAN_PA_MEASUREMENT_PILOT               7
#define WLAN_PA_DSE_POWER_CONSTRAINT            8
#define WLAN_PA_VENDOR_SPECIFIC                 9
#define WLAN_PA_GAS_INITIAL_REQ                 10
#define WLAN_PA_GAS_INITIAL_RESP                11
#define WLAN_PA_GAS_COMEBACK_REQ                12
#define WLAN_PA_GAS_COMEBACK_RESP               13
#define WLAN_TDLS_DISCOVERY_RESPONSE            14
#define WLAN_PA_LOCATION_TRACK_NOTIFICATION     15
#define WLAN_PA_QAB_REQUEST_FRAME               16
#define WLAN_PA_QAB_RESPONSE_FRAME              17
#define WLAN_PA_QMF_POLICY                      18
#define WLAN_PA_QMF_POLICY_CHANGE               19
#define WLAN_PA_QLOAD_REQUEST                   20
#define WLAN_PA_QLOAD_REPORT                    21
#define WLAN_PA_HCCA_TXOP_ADVERTISEMENT         22
#define WLAN_PA_HCCA_TXOP_RESPONSE              23
#define WLAN_PA_PUBLIC_KEY                      24
#define WLAN_PA_CHANNEL_AVAILABILITY_QUERY      25
#define WLAN_PA_CHANNEL_SCHEDULE_MANAGEMENT     26
#define WLAN_PA_CONTACT_VERIFICATION_SIGNAL     27
#define WLAN_PA_GDD_ENABLEMENT_REQ              28
#define WLAN_PA_GDD_ENABLEMENT_RESP             29
#define WLAN_PA_NETWORK_CHANNEL_CONTROL         30
#define WLAN_PA_WHITE_SPACE_MAP_ANNOUNCEMENT    31
#define WLAN_PA_FTM_REQUEST                     32
#define WLAN_PA_FTM                             33
#define WLAN_PA_FILS_DISCOVERY                  34
#define WLAN_PA_LOCATION_MEASUREMENT_REPORT     47

/* Protected Dual of Public Action frames (IEEE Std 802.11-2016, 9.6.11,
 * Table 9-332) */
#define WLAN_PROT_DSE_ENABLEMENT                1
#define WLAN_PROT_DSE_DEENABLEMENT              2
#define WLAN_PROT_EXT_CSA                       4
#define WLAN_PROT_MEASUREMENT_REQ               5
#define WLAN_PROT_MEASUREMENT_REPORT            6
#define WLAN_PROT_DSE_POWER_CONSTRAINT          8
#define WLAN_PROT_VENDOR_SPECIFIC               9
#define WLAN_PROT_GAS_INITIAL_REQ               10
#define WLAN_PROT_GAS_INITIAL_RESP              11
#define WLAN_PROT_GAS_COMEBACK_REQ              12
#define WLAN_PROT_GAS_COMEBACK_RESP             13
#define WLAN_PROT_QAB_REQUEST_FRAME             16
#define WLAN_PROT_QAB_RESPONSE_FRAME            17
#define WLAN_PROT_QMF_POLICY                    18
#define WLAN_PROT_QMF_POLICY_CHANGE             19
#define WLAN_PROT_QLOAD_REQUEST                 20
#define WLAN_PROT_QLOAD_REPORT                  21
#define WLAN_PROT_HCCA_TXOP_ADVERTISEMENT       22
#define WLAN_PROT_HCCA_TXOP_RESPONSE            23
#define WLAN_PROT_CHANNEL_AVAILABILITY_QUERY    25
#define WLAN_PROT_CHANNEL_SCHEDULE_MANAGEMENT   26
#define WLAN_PROT_CONTACT_VERIFICATION_SIGNAL   27
#define WLAN_PROT_GDD_ENABLEMENT_REQ            28
#define WLAN_PROT_GDD_ENABLEMENT_RESP           29
#define WLAN_PROT_NETWORK_CHANNEL_CONTROL       30
#define WLAN_PROT_WHITE_SPACE_MAP_ANNOUNCEMENT  31

/* SA Query Action frame (IEEE 802.11w/D8.0, 7.4.9) */
#define WLAN_SA_QUERY_REQUEST               0
#define WLAN_SA_QUERY_RESPONSE              1

#define WLAN_SA_QUERY_TR_ID_LEN             2

/* TDLS action codes */
#define WLAN_TDLS_SETUP_REQUEST             0
#define WLAN_TDLS_SETUP_RESPONSE            1
#define WLAN_TDLS_SETUP_CONFIRM             2
#define WLAN_TDLS_TEARDOWN                  3
#define WLAN_TDLS_PEER_TRAFFIC_INDICATION   4
#define WLAN_TDLS_CHANNEL_SWITCH_REQUEST    5
#define WLAN_TDLS_CHANNEL_SWITCH_RESPONSE   6
#define WLAN_TDLS_PEER_PSM_REQUEST          7
#define WLAN_TDLS_PEER_PSM_RESPONSE         8
#define WLAN_TDLS_PEER_TRAFFIC_RESPONSE     9
#define WLAN_TDLS_DISCOVERY_REQUEST         10

