tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/wifi_manager/wpas/ieee802_11_defs.h
/* Radio Measurement Action codes */
#define WLAN_RRM_RADIO_MEASUREMENT_REQUEST  0
#define WLAN_RRM_RADIO_MEASUREMENT_REPORT   1
#define WLAN_RRM_LINK_MEASUREMENT_REQUEST   2
#define WLAN_RRM_LINK_MEASUREMENT_REPORT    3
#define WLAN_RRM_NEIGHBOR_REPORT_REQUEST    4
#define WLAN_RRM_NEIGHBOR_REPORT_RESPONSE   5

/* Protected Fine Timing Frame Action Field value */
#define WLAN_PROT_FTM_REQUEST   1
#define WLAN_PROT_FTM           2
#define WLAN_PROT_FTM_REPORT    3

#define OUI_MICROSOFT           0x0050f2 /* Microsoft (also used in Wi-Fi specs)*/
#define WPA_IE_VENDOR_TYPE      0x0050f201
#define WMM_IE_VENDOR_TYPE      0x0050f202
#define WPS_IE_VENDOR_TYPE      0x0050f204
#define OUI_WFA                 0x506f9a
#define P2P_IE_VENDOR_TYPE      0x506f9a09
#define WFD_IE_VENDOR_TYPE      0x506f9a0a
#define WFD_OUI_TYPE            10
#define HS20_IE_VENDOR_TYPE     0x506f9a10
#define OSEN_IE_VENDOR_TYPE     0x506f9a12
#define MBO_IE_VENDOR_TYPE      0x506f9a16
#define MBO_OUI_TYPE            22
#define OWE_IE_VENDOR_TYPE      0x506f9a1c
#define OWE_OUI_TYPE            28
#define MULTI_AP_OUI_TYPE       0x1B
#define DPP_CC_IE_VENDOR_TYPE   0x506f9a1e
#define DPP_CC_OUI_TYPE         0x1e
#define SAE_PK_IE_VENDOR_TYPE   0x506f9a1f
#define SAE_PK_OUI_TYPE         0x1f
#define QM_IE_VENDOR_TYPE       0x506f9a22
#define QM_IE_OUI_TYPE          0x22
#define WFA_CAPA_IE_VENDOR_TYPE 0x506f9a23
#define WFA_CAPA_OUI_TYPE       0x23

/* Radio Measurement capabilities (from RM Enabled Capabilities element)
 * IEEE Std 802.11-2016, 9.4.2.45, Table 9-157 */
/* byte 1 (out of 5) */
#define WLAN_RRM_CAPS_LINK_MEASUREMENT      BIT(0)
#define WLAN_RRM_CAPS_NEIGHBOR_REPORT       BIT(1)
#define WLAN_RRM_CAPS_BEACON_REPORT_PASSIVE BIT(4)
#define WLAN_RRM_CAPS_BEACON_REPORT_ACTIVE  BIT(5)
#define WLAN_RRM_CAPS_BEACON_REPORT_TABLE   BIT(6)
/* byte 2 (out of 5) */
#define WLAN_RRM_CAPS_LCI_MEASUREMENT       BIT(4)
/* byte 5 (out of 5) */
#define WLAN_RRM_CAPS_FTM_RANGE_REPORT      BIT(2)

/*
 * IEEE P802.11-REVmc/D5.0, 9.4.2.21.19 (Fine Timing Measurement Range
 * request) - Minimum AP count
 */
#define WLAN_RRM_RANGE_REQ_MAX_MIN_AP   15

/* Timeout Interval Type */
#define WLAN_TIMEOUT_REASSOC_DEADLINE   1
#define WLAN_TIMEOUT_KEY_LIFETIME       2
#define WLAN_TIMEOUT_ASSOC_COMEBACK     3

#define FILS_NONCE_LEN      16
#define FILS_SESSION_LEN    8
#define FILS_CACHE_ID_LEN   2
#define FILS_MAX_KEY_AUTH_LEN 48

struct ieee80211_hdr {
    uint16_t frame_control;
    uint16_t duration_id;
    uint8_t  addr1[6];
    uint8_t  addr2[6];
    uint8_t  addr3[6];
    uint16_t seq_ctrl;
    /* followed by 'uint8_t addr4[6];' if ToDS and FromDS is set in data frame
     */
} STRUCT_PACKED;


#define IEEE80211_HDRLEN (sizeof(struct ieee80211_hdr))

#define IEEE80211_FC(type, stype) host_to_le16((type << 2) | (stype << 4))

#define WPAS_MIN_PASSPHRASE_LEN 8
#define WPAS_MAX_PASSPHRASE_LEN 63

// #define AUTH_IE_OFFSET       6

struct ieee80211_mgmt {
    uint16_t frame_control;
    uint16_t duration;
    uint8_t  da[6];
    uint8_t  sa[6];
    uint8_t  bssid[6];
    uint16_t seq_ctrl;
    union {
        struct {
            uint16_t auth_alg;
            uint16_t auth_transaction;
            uint16_t status_code;
            /* possibly followed by Challenge text */
            uint8_t variable[];
        } STRUCT_PACKED auth;
        struct {
            uint16_t reason_code;
            uint8_t variable[];
        } STRUCT_PACKED deauth;
        struct {
            uint16_t capab_info;
            uint16_t listen_interval;
            /* followed by SSID and Supported rates */
            uint8_t variable[];
        } STRUCT_PACKED assoc_req;
        struct {
            uint16_t capab_info;
            uint16_t status_code;
            uint16_t aid;
            /* followed by Supported rates */
            uint8_t variable[];
        } STRUCT_PACKED assoc_resp, reassoc_resp;
        struct {
            uint16_t capab_info;
            uint16_t listen_interval;
            uint8_t current_ap[6];
            /* followed by SSID and Supported rates */
            uint8_t variable[];
        } STRUCT_PACKED reassoc_req;
        struct {
            uint16_t reason_code;
            uint8_t variable[];
        } STRUCT_PACKED disassoc;
        struct {
            uint8_t timestamp[8];
            uint16_t beacon_int;
            uint16_t capab_info;
            /* followed by some of SSID, Supported rates,
             * FH Params, DS Params, CF Params, IBSS Params, TIM */
            uint8_t variable[];
        } STRUCT_PACKED beacon;
        /* probe_req: only variable items: SSID, Supported rates */
        struct {
            uint8_t timestamp[8];
            uint16_t beacon_int;
            uint16_t capab_info;
            /* followed by some of SSID, Supported rates,
             * FH Params, DS Params, CF Params, IBSS Params */
            uint8_t variable[];
        } STRUCT_PACKED probe_resp;
        struct {
            uint8_t category;
            union {
                struct {
                    uint8_t action_code;
                    uint8_t dialog_token;
                    uint8_t status_code;
                    uint8_t variable[];
                } STRUCT_PACKED wmm_action;
                struct{
                    uint8_t action_code;
                    uint8_t element_id;
                    uint8_t length;
                    uint8_t switch_mode;
                    uint8_t new_chan;
                    uint8_t switch_count;
                } STRUCT_PACKED chan_switch;
                struct{
                    uint8_t action_code;
                    uint16_t trans_id;
                } STRUCT_PACKED sa_query;
                struct {
                    uint8_t action;
                    uint8_t variable[];
                } STRUCT_PACKED public_action;

            } u;
        } STRUCT_PACKED action;
    } u;
} STRUCT_PACKED;

/* HT Capabilities element */
struct ieee80211_ht_capabilities {
    uint16_t ht_capabilities_info;
    uint8_t a_mpdu_params; /* Maximum A-MPDU Length Exponent B0..B1
               * Minimum MPDU Start Spacing B2..B4
               * Reserved B5..B7 */
    uint8_t supported_mcs_set[16];
    uint16_t ht_extended_capabilities;
    uint32_t tx_bf_capability_info;
    uint8_t asel_capabilities;
} STRUCT_PACKED;


