tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/wifi_manager/wpas/ieee802_11_defs.h
/* HT Operation element */
struct ieee80211_ht_operation {
    uint8_t primary_chan;
    /* Five octets of HT Operation Information */
    uint8_t ht_param; /* B0..B7 */
    uint16_t operation_mode; /* B8..B23 */
    uint16_t param; /* B24..B39 */
    uint8_t basic_mcs_set[16];
} STRUCT_PACKED;

struct ieee80211_vht_capabilities {
    uint32_t vht_capabilities_info;
    struct {
        uint16_t rx_map;
        uint16_t rx_highest;
        uint16_t tx_map;
        uint16_t tx_highest;
    } vht_supported_mcs_set;
} STRUCT_PACKED;

struct ieee80211_vht_operation {
    uint8_t vht_op_info_chwidth;
    uint8_t vht_op_info_chan_center_freq_seg0_idx;
    uint8_t vht_op_info_chan_center_freq_seg1_idx;
    uint16_t vht_basic_mcs_set;
} STRUCT_PACKED;

/* HT Capabilities Info field within HT Capabilities element */
#define HT_CAP_INFO_LDPC_CODING_CAP             ((uint16_t) BIT(0))
#define HT_CAP_INFO_SUPP_CHANNEL_WIDTH_SET      ((uint16_t) BIT(1))
#define HT_CAP_INFO_SMPS_MASK                   ((uint16_t) (BIT(2) | BIT(3)))
#define HT_CAP_INFO_SMPS_STATIC                 ((uint16_t) 0)
#define HT_CAP_INFO_SMPS_DYNAMIC                ((uint16_t) BIT(2))
#define HT_CAP_INFO_SMPS_DISABLED               ((uint16_t) (BIT(2) | BIT(3)))
#define HT_CAP_INFO_GREEN_FIELD                 ((uint16_t) BIT(4))
#define HT_CAP_INFO_SHORT_GI20MHZ               ((uint16_t) BIT(5))
#define HT_CAP_INFO_SHORT_GI40MHZ               ((uint16_t) BIT(6))
#define HT_CAP_INFO_TX_STBC                     ((uint16_t) BIT(7))
#define HT_CAP_INFO_RX_STBC_MASK                ((uint16_t) (BIT(8) | BIT(9)))
#define HT_CAP_INFO_RX_STBC_1                   ((uint16_t) BIT(8))
#define HT_CAP_INFO_RX_STBC_12                  ((uint16_t) BIT(9))
#define HT_CAP_INFO_RX_STBC_123                 ((uint16_t) (BIT(8) | BIT(9)))
#define HT_CAP_INFO_DELAYED_BA                  ((uint16_t) BIT(10))
#define HT_CAP_INFO_MAX_AMSDU_SIZE              ((uint16_t) BIT(11))
#define HT_CAP_INFO_DSSS_CCK40MHZ               ((uint16_t) BIT(12))
/* B13 - Reserved (was PSMP support during P802.11n development) */
#define HT_CAP_INFO_40MHZ_INTOLERANT            ((uint16_t) BIT(14))
#define HT_CAP_INFO_LSIG_TXOP_PROTECT_SUPPORT   ((uint16_t) BIT(15))

#define ERP_INFO_NON_ERP_PRESENT BIT(0)
#define ERP_INFO_USE_PROTECTION BIT(1)
#define ERP_INFO_BARKER_PREAMBLE_MODE BIT(2)

/* HT Protection (B8..B9 of HT Operation Information) */
#define HT_PROT_NO_PROTECTION           0
#define HT_PROT_NONMEMBER_PROTECTION    1
#define HT_PROT_20MHZ_PROTECTION        2
#define HT_PROT_NON_HT_MIXED            3
/* Bits within ieee80211_ht_operation::operation_mode (BIT(0) maps to B8 in
 * HT Operation Information) */
#define HT_OPER_OP_MODE_HT_PROT_MASK ((uint16_t)    (BIT(0) | BIT(1))) /* B8..B9 */
#define HT_OPER_OP_MODE_NON_GF_HT_STAS_PRESENT      ((uint16_t) BIT(2)) /* B10 */
/* BIT(3), i.e., B11 in HT Operation Information field - Reserved */
#define HT_OPER_OP_MODE_OBSS_NON_HT_STAS_PRESENT    ((uint16_t) BIT(4)) /* B12 */
/* BIT(5)..BIT(15), i.e., B13..B23 - Reserved */

#define HE_NSS_MAX_STREAMS                8

#define MULTI_AP_SUB_ELEM_TYPE  0x06
#define MULTI_AP_TEAR_DOWN      BIT(4)
#define MULTI_AP_FRONTHAUL_BSS  BIT(5)
#define MULTI_AP_BACKHAUL_BSS   BIT(6)
#define MULTI_AP_BACKHAUL_STA   BIT(7)

#define WMM_OUI_TYPE                        2
#define WMM_OUI_SUBTYPE_INFORMATION_ELEMENT 0
#define WMM_OUI_SUBTYPE_PARAMETER_ELEMENT   1
#define WMM_OUI_SUBTYPE_TSPEC_ELEMENT       2
#define WMM_VERSION                         1

/*
 * WMM Information Element (used in (Re)Association Request frames; may also be
 * used in Beacon frames)
 */
struct wmm_information_element {
    /* Element ID: 221 (0xdd); Length: 7 */
    /* required fields for WMM version 1 */
    uint8_t oui[3]; /* 00:50:f2 */
    uint8_t oui_type; /* 2 */
    uint8_t oui_subtype; /* 0 */
    uint8_t version; /* 1 for WMM version 1.0 */
    uint8_t qos_info; /* AP/STA specific QoS info */

} STRUCT_PACKED;

#define WMM_AC_AIFSN_MASK 0x0f
#define WMM_AC_AIFNS_SHIFT 0
#define WMM_AC_ACM 0x10
#define WMM_AC_ACI_MASK 0x60
#define WMM_AC_ACI_SHIFT 5

#define WMM_AC_ECWMIN_MASK 0x0f
#define WMM_AC_ECWMIN_SHIFT 0
#define WMM_AC_ECWMAX_MASK 0xf0
#define WMM_AC_ECWMAX_SHIFT 4

struct wmm_ac_parameter {
    uint8_t aci_aifsn; /* AIFSN, ACM, ACI */
    uint8_t cw; /* ECWmin, ECWmax (CW = 2^ECW - 1) */
    uint16_t txop_limit;
} STRUCT_PACKED;

/*
 * WMM Parameter Element (used in Beacon, Probe Response, and (Re)Association
 * Response frmaes)
 */
struct wmm_parameter_element {
    /* Element ID: 221 (0xdd); Length: 24 */
    /* required fields for WMM version 1 */
    uint8_t oui[3]; /* 00:50:f2 */
    uint8_t oui_type; /* 2 */
    uint8_t oui_subtype; /* 1 */
    uint8_t version; /* 1 for WMM version 1.0 */
    uint8_t qos_info; /* AP/STA specific QoS info */
    uint8_t reserved; /* 0 */
    struct wmm_ac_parameter ac[4]; /* AC_BE, AC_BK, AC_VI, AC_VO */
} STRUCT_PACKED;

/* Access Categories / ACI to AC coding */
enum wmm_ac {
    WMM_AC_BE = 0 /* Best Effort */,
    WMM_AC_BK = 1 /* Background */,
    WMM_AC_VI = 2 /* Video */,
    WMM_AC_VO = 3 /* Voice */,
    WMM_AC_NUM = 4
};

#define OUI_BROADCOM        0x00904c /* Broadcom (Epigram) */
#define VENDOR_VHT_TYPE     0x04
#define VENDOR_VHT_SUBTYPE  0x08
#define VENDOR_VHT_SUBTYPE2 0x00

#define VENDOR_HT_CAPAB_OUI_TYPE 0x33 /* 00-90-4c:0x33 */

struct ieee80211_he_capabilities {
    uint8_t he_mac_capab_info[6];
    uint8_t he_phy_capab_info[11];
    /* Followed by 4, 8, or 12 octets of Supported HE-MCS And NSS Set field
    * and optional variable length PPE Thresholds field. */
    uint8_t optional[37];
} STRUCT_PACKED;

#define IEEE80211_HE_CAPAB_MIN_LEN (6 + 11)
struct ieee80211_he_operation {
    uint32_t he_oper_params; /* HE Operation Parameters[3] and
                  * BSS Color Information[1] */
    uint16_t he_mcs_nss_set;
    /* Followed by conditional VHT Operation Information (3 octets),
     * Max Co-Hosted BSSID Indicator subfield (1 octet), and/or 6 GHz
     * Operation Information subfield (5 octets). */
} STRUCT_PACKED;

/* HE Capabilities Information defines */
#define HE_MACCAP_TWT_RESPONDER                         ((uint8_t) BIT(2))

