tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/wifi_manager/wpas/ieee802_11_defs.h
#define HE_PHYCAP_CHANNEL_WIDTH_SET_IDX                 0
#define HE_PHYCAP_CHANNEL_WIDTH_MASK                    ((uint8_t) (BIT(1) | BIT(2) | \
                                                                    BIT(3) | BIT(4)))
#define HE_PHYCAP_CHANNEL_WIDTH_SET_40MHZ_IN_2G         ((uint8_t) BIT(1))
#define HE_PHYCAP_CHANNEL_WIDTH_SET_40MHZ_80MHZ_IN_5G   ((uint8_t) BIT(2))
#define HE_PHYCAP_CHANNEL_WIDTH_SET_160MHZ_IN_5G        ((uint8_t) BIT(3))
#define HE_PHYCAP_CHANNEL_WIDTH_SET_80PLUS80MHZ_IN_5G   ((uint8_t) BIT(4))

#define HE_PHYCAP_SU_BEAMFORMER_CAPAB_IDX   3
#define HE_PHYCAP_SU_BEAMFORMER_CAPAB       ((uint8_t) BIT(7))
#define HE_PHYCAP_SU_BEAMFORMEE_CAPAB_IDX   4
#define HE_PHYCAP_SU_BEAMFORMEE_CAPAB       ((uint8_t) BIT(0))
#define HE_PHYCAP_MU_BEAMFORMER_CAPAB_IDX   4
#define HE_PHYCAP_MU_BEAMFORMER_CAPAB       ((uint8_t) BIT(1))

#define HE_PHYCAP_PPE_THRESHOLD_PRESENT_IDX 6
#define HE_PHYCAP_PPE_THRESHOLD_PRESENT     ((uint8_t) BIT(7))

/* HE PPE Threshold define */
#define HE_PPE_THRES_RU_INDEX_BITMASK_MASK  0xf
#define HE_PPE_THRES_RU_INDEX_BITMASK_SHIFT 3
#define HE_PPE_THRES_NSS_MASK               0x7

/* HE Operation defines */
/* HE Operation Parameters and BSS Color Information fields */
#define HE_OPERATION_DFLT_PE_DURATION_MASK      ((uint32_t) (BIT(0) | BIT(1) | \
                                                            BIT(2)))
#define HE_OPERATION_DFLT_PE_DURATION_OFFSET    0
#define HE_OPERATION_TWT_REQUIRED               ((uint32_t) BIT(3))
#define HE_OPERATION_RTS_THRESHOLD_MASK         ((uint32_t) (BIT(4) | BIT(5) | \
                                                            BIT(6) | BIT(7) | \
                                                            BIT(8) | BIT(9) | \
                                                            BIT(10) | BIT(11) | \
                                                            BIT(12) | BIT(13)))
#define HE_OPERATION_RTS_THRESHOLD_OFFSET   4
#define HE_OPERATION_VHT_OPER_INFO          ((uint32_t) BIT(14))
#define HE_OPERATION_COHOSTED_BSS           ((uint32_t) BIT(15))
#define HE_OPERATION_ER_SU_DISABLE          ((uint32_t) BIT(16))
#define HE_OPERATION_6GHZ_OPER_INFO         ((uint32_t) BIT(17))
#define HE_OPERATION_BSS_COLOR_MASK         ((uint32_t) (BIT(24) | BIT(25) | \
                                                        BIT(26) | BIT(27) | \
                                                        BIT(28) | BIT(29)))
#define HE_OPERATION_BSS_COLOR_PARTIAL      ((uint32_t) BIT(30))
#define HE_OPERATION_BSS_COLOR_DISABLED     ((uint32_t) BIT(31))
#define HE_OPERATION_BSS_COLOR_OFFSET       24

#ifndef offsetof
#define offsetof(type, member) ((long) &((type *) 0)->member)
#endif

#define MAX_NOF_MB_IES_SUPPORTED    5
#define MAX_NUM_FRAG_IES_SUPPORTED  3

struct mb_ies_info {
    struct {
        const uint8_t *ie;
        uint8_t ie_len;
    } ies[MAX_NOF_MB_IES_SUPPORTED];
    uint8_t nof_ies;
};

struct frag_ies_info {
    struct {
        uint8_t eid;
        uint8_t eid_ext;
        const uint8_t *ie;
        uint8_t ie_len;
    } frags[MAX_NUM_FRAG_IES_SUPPORTED];

    uint8_t n_frags;

    /* the last parsed element ID and element extension ID */
    uint8_t last_eid;
    uint8_t last_eid_ext;
};

/* Parsed Information Elements */
struct ieee802_11_elems {
    const uint8_t *ssid;
    const uint8_t *supp_rates;
    const uint8_t *ds_params;
    const uint8_t *challenge;
    const uint8_t *erp_info;
    const uint8_t *ext_supp_rates;
    const uint8_t *wpa_ie;
    const uint8_t *rsn_ie;
    const uint8_t *rsnxe;
    const uint8_t *wmm; /* WMM Information or Parameter Element */
    const uint8_t *wmm_tspec;
    const uint8_t *wps_ie;
    const uint8_t *supp_channels;
    const uint8_t *mdie;
    const uint8_t *ftie;
    const uint8_t *timeout_int;
    const uint8_t *ht_capabilities;
    const uint8_t *ht_operation;
    const uint8_t *mesh_config;
    const uint8_t *mesh_id;
    const uint8_t *peer_mgmt;
    const uint8_t *vht_capabilities;
    const uint8_t *vht_operation;
    const uint8_t *vht_opmode_notif;
    const uint8_t *vendor_ht_cap;
    const uint8_t *vendor_vht;
    const uint8_t *p2p;
    const uint8_t *wfd;
    const uint8_t *link_id;
    const uint8_t *interworking;
    const uint8_t *qos_map_set;
    const uint8_t *hs20;
    const uint8_t *ext_capab;
    const uint8_t *bss_max_idle_period;
    const uint8_t *ssid_list;
    const uint8_t *osen;
    const uint8_t *mbo;
    const uint8_t *ampe;
    const uint8_t *mic;
    const uint8_t *pref_freq_list;
    const uint8_t *supp_op_classes;
    const uint8_t *rrm_enabled;
    const uint8_t *cag_number;
    const uint8_t *ap_csn;
    const uint8_t *fils_indic;
    const uint8_t *dils;
    const uint8_t *assoc_delay_info;
    const uint8_t *fils_req_params;
    const uint8_t *fils_key_confirm;
    const uint8_t *fils_session;
    const uint8_t *fils_hlp;
    const uint8_t *fils_ip_addr_assign;
    const uint8_t *key_delivery;
    const uint8_t *wrapped_data;
    const uint8_t *fils_pk;
    const uint8_t *fils_nonce;
    const uint8_t *owe_dh;
    const uint8_t *power_capab;
    const uint8_t *roaming_cons_sel;
    const uint8_t *password_id;
    const uint8_t *oci;
    const uint8_t *multi_ap;
    const uint8_t *he_capabilities;
    const uint8_t *he_operation;
    const uint8_t *short_ssid_list;
    const uint8_t *he_6ghz_band_cap;
    const uint8_t *sae_pk;
    const uint8_t *s1g_capab;
    const uint8_t *pasn_params;

    uint8_t ssid_len;
    uint8_t supp_rates_len;
    uint8_t challenge_len;
    uint8_t ext_supp_rates_len;
    uint8_t wpa_ie_len;
    uint8_t rsn_ie_len;
    uint8_t rsnxe_len;
    uint8_t wmm_len; /* 7 = WMM Information; 24 = WMM Parameter */
    uint8_t wmm_tspec_len;
    uint8_t wps_ie_len;
    uint8_t supp_channels_len;
    uint8_t mdie_len;
    uint8_t ftie_len;
    uint8_t mesh_config_len;
    uint8_t mesh_id_len;
    uint8_t peer_mgmt_len;
    uint8_t vendor_ht_cap_len;
    uint8_t vendor_vht_len;
    uint8_t p2p_len;
    uint8_t wfd_len;
    uint8_t interworking_len;
    uint8_t qos_map_set_len;
    uint8_t hs20_len;
    uint8_t ext_capab_len;
    uint8_t ssid_list_len;
    uint8_t osen_len;
    uint8_t mbo_len;
    uint8_t ampe_len;
    uint8_t mic_len;
    uint8_t pref_freq_list_len;
    uint8_t supp_op_classes_len;
    uint8_t rrm_enabled_len;
    uint8_t cag_number_len;
    uint8_t fils_indic_len;
    uint8_t dils_len;
    uint8_t fils_req_params_len;
    uint8_t fils_key_confirm_len;
    uint8_t fils_hlp_len;
    uint8_t fils_ip_addr_assign_len;
    uint8_t key_delivery_len;
    uint8_t wrapped_data_len;
    uint8_t fils_pk_len;
    uint8_t owe_dh_len;
    uint8_t power_capab_len;
    uint8_t roaming_cons_sel_len;
    uint8_t password_id_len;
    uint8_t oci_len;
    uint8_t multi_ap_len;
    uint8_t he_capabilities_len;
    uint8_t he_operation_len;
    uint8_t short_ssid_list_len;
    uint8_t sae_pk_len;
    uint8_t pasn_params_len;

    struct mb_ies_info mb_ies;
    struct frag_ies_info frag_ies;
};

#endif /* _IEEE802_11_DEFS_H_ */
